void
 
F
(
)
{
char
*
data
;
_
buf
[
100
]
=
"
source
HMODULE
hModule
LoadLibraryA
if
!=
NULL
FreeLibrary
printLine
Library
loaded
and
freed
successfully
}
else
Unable
to
load
library
size
t
len
strlen
environment
GETENV
ENV
VARIABLE
strncat
+
,
-
1
strcpy
C
:
\\Windows\\System32\\winsrv
.
dll
0
5
==
static
const
f
five
returns
global
or
switch
6
case
break
default
while
int
h
i
for
<
goto
copy
ptr1
&
ptr2
union
type
my
a
b
sink
func
ptr
>
fgets
stdin
'
\0
FILE
pFile
FOPEN
\\temp\\file
txt
r
fclose
winsrv
return
wchar
L
LoadLibraryW
wcslen
wcsncat
wcscpy
fgetws
charvoid
cv
struct
y
SRC
STR
memcpy
x
sizeof
/
j
k
memmove
Fbuf
ALLOCA
50
goodbuf
src
memset
strcat
badbuf
strncpy
snprintf
%
s
printIntLine
long
printLongLongLine
twoints
printStructLine
wmemset
wcscat
printWLine
wcsncpy
snwprintf
A
dest
malloc
free
linked
list
head
next
prev
bad
8
sz
10
AAAAAAAAA
>=
printHexCharLine
ERROR
Array
index
is
negative
&&
out
of
bounds
2
3
4
7
9
printWcharLine
input
CHAR
ARRAY
SIZE
atoi
fscanf
d
RAND32
STRING
fprintf
stdout
s\n
printf
SNPRINTF
vasink
fixedstringtest
vasinkb
vasinkg
fwprintf
wprintf
WIDE
calloc
150
149
99
strncmp
PASSWORD
Access
granted
elseprintLine
denied
!
strcmp
strstr
P
wcsncmp
wcscmp
wcsstr
first
second
c
l
u
0x10203040
|
0x80
LONG
MIN
MAX
result
Input
value
too
large
perform
arithmetic
safely
<=
sqrt
rand
INT
unsigned
UCHAR
printHexUnsignedCharLine
hc
UINT
printUnsignedLine
small
dst
DST
SZ
COPY
short
hd
exit
hd\n
SHRT
password
HANDLE
pHandle
username
User
domain
Domain
LogonUserA
LOGON32
LOGON
NETWORK
PROVIDER
DEFAULT
logge
in
CloseHandle
login
logged
SecureZeroMemory
LogonUserW
FILENAME
BASEPATH
file
wb
fd
OPEN
O
RDWR
CREAT
S
IREAD
IWRITE
CLOSE
hFile
CreateFileA
GENERIC
WRITE
READ
ALWAYS
ATTRIBUTE
NORMAL
INVALID
VALUE
CreateFileW
gets
Error
Condition
alter
control
flow
indicate
action
taken
Please
enter
string
failed
fputc
EOF
fputs
fread
99s\0
fwrite
putc
putchar
puts
REMOVE
removemeF
removemebad
remove
RENAME
OLD
BAD
NAME
newFfilename
GOOD
newgoodfilename
rename
newbadfilename
scanf
sscanf
hMutex
CreateMutexA
FALSE
GetLastError
ALREADY
EXISTS
pipeName
\\\\
\\pipe\\mypipe
hPipe
BOOL
fConnected
CreateNamedPipeA
FLAG
FIRST
PIPE
INSTANCE
TYPE
MESSAGE
READMODE
WAIT
UNLIMITED
INSTANCES
BUFSIZE
NMPWAIT
USE
ConnectNamedPipe
?
TRUE
CONNECTED
ACCESS
DENIED
ImpersonateNamedPipeClient
ImpersonateSelf
SecurityImpersonation
RpcImpersonateClient
RPC
OK
fputwc
WEOF
fputws
fwscanf
putwc
putwchar
putws
wremove
wrename
wscanf
swscanf
CreateMutexW
CreateNamedPipeW
fopen
passwords
key
TEST\\TestKey
HKEY
hKey
RegCreateKeyA
LOCAL
MACHINE
SUCCESS
Registry
could
not
be
created
CURRENT
USER
RegCreateKeyExA
REG
OPTION
NON
VOLATILE
KEY
RegOpenKeyExA
opened
HUSKEY
SHRegCreateUSKeyA
SHREGSET
HKCU
outKey
SHRegOpenUSKeyA
RegCreateKeyW
RegCreateKeyExW
RegOpenKeyExW
SHRegCreateUSKeyW
SHRegOpenUSKeyW
pipe
\\pipe\\test
DUPLEX
Impersonated
RevertToSelf
d\n
Failed
impersonate
HDESK
hDesk
dtName
DesktopExample
CreateDesktopA
ALL
Desktop
CloseDesktop
filename
SHARE
CREATE
NEW
File
HWINSTA
hWStation
wStationName
WindowsStationExample
CreateWindowStationA
Windows
station
Station
CloseWindowStation
CreateDesktopW
CreateWindowStationW
cryptokey
CRYPTOKEY
HCRYPTPROV
hCryptProv
BYTE
pbData
CryptAcquireContextW
PROV
RSA
FULL
CryptGenRandom
CryptReleaseContext
helper
sig
g
cur
val
signal
SIGINT
SIG
DFL
good
time
W
Bad
Sink
25
Good
STAT
statbuf
float
0F
printDoubleLine
double
atof
tmp
template
fnXXXXXX
mktemp
Temporary
was
now
closing
EXCL
tempnam
tmpnam
PATH
GetTempFileNameA
wmktemp
wfopen
wtempnam
wtmpnam
GetTempFileNameW
BadSinkBody
w
Write
something
the
The
open
realloc
errno
err
code
get
EDOM
strtol
0xfffffffff
ERANGE
li\n
st
str
wcstombs
\xffff
EILSEQ
myfile
Success
Failure
error
E
Other
success
NOT
OPENED
count
Hello
20
output
SENTENCE
String
5L
130000
New
10L
mystring
strdup
wcsdup
BadSource
freopen
CreateFile
w32CreateFile
aString
revString
reversedString
BadSink
GoodSink
OS
COMMAND
POPEN
PCLOSE
system
wsystem
250
PUTENV
uninit
array
temp
UNLINK
ch
getc
z
7E300
2147483643
pointer
toPrint
end
strchr
ptrdiff
slash
indexOfSlash
string1
string2
slashInString1
indexOfSlashInString1
wcschr
abcdefghijklmnopqrstuvwxyz
shouldn\
see
this
p
Got
0\n
INPUT
debug
Log
some
info
that
inappropriate
release
This
actual
functionality
TIME
CHECK
important
Happy
Year
attempted
access
with
access\n
stderr
AAAA
UMASK
0644
022
function
does
use
variable
02lx\n
parameter
Z
flag
Dead
Sometimes
prints
Never
Always
0x400000
Password1234
VirtualLock
Memory
locked
n
v
LOOP
15
assert
ASSERT
newpassword
256
INFO
1003
user
NET
API
STATUS
status
usri1003
Enter
new
255s
NetUserSetInfo
USERNAME
LPBYTE
NERR
Status
0x
x\n
oldpassword
old
NetUserChangePassword
level
RECURSION
IN
GoodSource
sprintf
Initialize
WFOPEN
SEARCH
We
have
match
FIXED
path
DWORD
length
GetCurrentDirectoryA
||
PathAppendA
AAAAAAAAAAAA
printSizeTLine
HELLO
less
than
10000
EXECL
ARG1
ARG2
ARG3
EXECLP
args
EXECV
EXECVP
spawnl
spawnlp
spawnv
spawnvp
wspawnl
wspawnlp
wspawnv
wspawnvp
delete
ref
CWE122
Heap
Based
Buffer
Overflow
__
cpp
cat
68
cpy
loop
ncat
ncpy
twointsclass
class
CWE124
Underwrite
CWE126
Overread
CWE127
Underread
hello
substr
try
catch
range
Range
specified
invalid
throw
e
Exception
caught
append
modified
myString
cout
after
call
endl
err1
err2
exception
ok
Test
c\n
CWE476
Pointer
Dereference
CWE590
Free
Of
Invalid
Not
On
alloca
declare
push
back
iterator
contains
begin
clear
200
cin
>>
width
CWE680
Integer
To
fixed
CWE114
Process
Control
w32
Environment
67
typedef
extern
fromConsole
fromFile
relativePath
CWE121
Stack
CWE123
What
Where
CWE129
Improper
Validation
Index
goodB2G
goodG2B
CWE131
Incorrect
Calculation
Size
CWE134
Uncontrolled
Format
va
start
vfprintf
vprintf
vsnprintf
vfwprintf
vwprintf
vsnwprintf
CWE135
Multibyte
Length
basic
CWE187
Partial
Comparison
ncmp
correct
pw
substring
CWE190
add
multiply
square
CWE191
Underflow
CWE194
Unexpected
Sign
Extension
CWE195
Signed
Unsigned
Conversion
CWE197
Numeric
Truncation
CWE23
Relative
Path
Traversal
CWE259
Hard
Coded
Password
CWE369
Divide
By
Zero
zero
divide
modulo
CWE36
Absolute
CWE400
Resource
Exhaustion
CWE401
Leak
CWE404
Shutdown
close
w32CloseHandle
CWE415
Double
CWE416
Use
After
CWE426
Untrusted
Search
popen
CWE427
Element
CWE464
Insertion
Data
Structure
Sentinel
CWE467
on
Type
CWE588
Attempt
Child
Non
CWE591
Sensitive
Storage
Improperly
Locked
CWE606
Unchecked
Loop
CWE617
Reachable
Assertion
CWE665
Initialization
CWE675
Duplicate
Operations
CWE690
Deref
from
Return
CWE761
At
Start
CWE772
Missing
Release
Effective
Lifetime
no
CWE789
Mem
Alloc
CWE78
Command
Injection
execl
execlp
execv
execvp
w32spawnl
w32spawnlp
w32spawnv
w32spawnvp
namespace
51
namespacevoid
61
62
63
64
65
66
CWE457
Uninitialized
Variable
init
using
std
CWE672
Operation
Expiration
CWE762
Mismatched
Management
Routines

ret
<<
32
shift
001
shifts
40
16
24
shift1
shift2
buf1
buf2
buf3
buf4
buf5
pbuf
sbuf
indexes
index1
index2
p1
p2
30
doubleptr
12
11
vmfree
arr
arri
005
vm
Changed
print
bufferundr
underrun2
message
isspace
\n
srcbuf
Code
loc
destbuf
o
loc1
loc2
T
test
newTest
008
s1
s2
glb
do
0x8000
14748365e
09F
4028235677973366e
38
0x0100
0x00010000
signed
0x1f
129
254
181
0x0111
0x0001
0x0011
0x1111
a1
a2
max
0x7f
0x7fff
0x7fffffff
0xff
0xffff
0xffffffff
0x0f
0x7fffff80
128
0x40000000
429496729
46340
88048
dlist
d1
d2
40282347e
38F
02824096e
31F
7976931348623157e
308
9958403095347198e
292
min
2147483647
2147483521
1073741825
40129846e
45F
9406564584124654e
324
foo
counter
str1
str2
gbl
ptr3
ptr4
node
node1
var
002
fptr
INDEX
elseret
label
ZERO
enum
buffer
stringPtr
baddst
SET
MEM
003
TEST
STRING#
TRIAL
fp1
fp2
rev
Second
22
33
func1
004
fptr1
pointertoarr
44
55
77
88
label2
set
st1
fptr3
elsetemp
STRING1
u1
60
00
034
elseif
condition
dptr
staticflag
elsea
lf
psink
staticflag1
s3
uni
Ptr
STRING00
STR1
STR2
STR3
007
pthread
mutex
PTHREAD
MUTEX
INITIALIZER
lock
unlock
tsk
pram
ip
self
Task1
Lock
Unlock
threadID#
lu
gbl1
tid1
create
join
destroy
tskentry
Task2
threadID
#
gbl2
tid2
1000
Task3
thread
gbl3
intptr
t1
t2
Task4
ld
th1
th2
sleep
Task5
gbl5
NO
THREAD
Task6
VAL
vptr
msg
log
STRINGMEM
BUFFER
cptr
Test123
devno
NDEVS
csr
READY
RESET
elsestrcpy
V
50000
flag1
flag2
pp
idx
1234
q
num
10^3700
exponent
10^37
ans
pow
dsink
10^3800
10^3008
arr1
arr2
8^3800
ans1
newarr
base
0000000000000000000000000000000000036
20000
2000
21000
10^3600
21
10^36
0004
10^3500
10^35000
10^3300
000004
10^10
7000
100^10
7100
10^30
10^3000
offset
race
pthread1
pthread2
pthread3
pthread4
instance1
mythread
pth
tid3
tid4
1073741823
1048576
524288
65536
buf6
buf7
buf8
1024
131072
262144
cnt
4096
B
42
13
23
43
31
34
41
Null
Assignment
volatile
pad
true
false
bool
dummy
String1
String3
String4
String5
ONE
TWO
values
UNINIT
VAR
dvar
dvar1
th
without
THREAD1
THREAD2
unuse
str3
STRING55
fptr2
dst1
dividend
divisor
divisors
divisor1
divisor2
