void
 
_main
(
)
{
char
*
data
;
data_buf
[
100
]
=
"
size_t
data_len
strlen
environment
GETENV
ENV_VARIABLE
if
!=
NULL
strncat
+
,
-
1
}
HMODULE
hModule
LoadLibraryA
FreeLibrary
printLine
Library
loaded
and
freed
successfully
else
Unable
to
load
library
global_returns_t_or_f
strcpy
C
:
\\Windows\\System32\\winsrv
.
dll
data_copy
data_ptr1
&
data_ptr2
_union_type
my_union
a
b
_main_sink
static
main_source
return
main_sink
func_ptr
_main_data
b_main_sink
c_main_sink
d_main_sink
e_main_sink
b_main_source
data_ptr
void_data_ptr
data_array
5
2
_struct_type
my_struct
WSADATA
wsa_data
int
wsa_data_init
0
recv_rv
struct
sockaddr_in
s_in
replace
SOCKET
connect_socket
INVALID_SOCKET
do
WSAStartup
MAKEWORD
NO_ERROR
break
socket
AF_INET
SOCK_STREAM
IPPROTO_TCP
==
memset
sizeof
sin_family
sin_addr
s_addr
inet_addr
127
sin_port
htons
TCP_PORT
connect
sockaddr
SOCKET_ERROR
recv
||
'
\0
strchr
\r
\n
while
CLOSE_SOCKET
WSACleanup
>
fgets
stdin
FILE
pFile
FOPEN
\\temp\\file
txt
r
fclose
listen_socket
accept_socket
INADDR_ANY
bind
listen
LISTEN_BACKLOG
accept
winsrv
wchar_t
L
wcslen
wcsncat
LoadLibraryW
wcscpy
wcschr
fgetws
charvoid
cv_struct
y
SRC_STR
memcpy
x
memmove
data_mainbuf
ALLOCA
50
data_goodbuf
src
strcat
i
for
<
strncpy
_snprintf
%
s
printIntLine
long
printLongLongLine
twoints
printStructLine
wcscat
printWLine
wcsncpy
_snwprintf
dest
malloc
free
main
new
delete
data_ref
union_type
main_data
main_sink_b
main_sink_c
main_sink_d
main_sink_e
struct_type
twointsclass
main_struct
linked_list
head
list
next
prev
/
A
8
wmemset
dest_sz
input_buf
CHAR_ARRAY_SIZE
atoi
10
AAAAAAAAA
>=
printHexCharLine
ERROR
Array
index
is
negative
7
out
of
bounds
3
4
6
9
&&
printWcharLine
fscanf
d
RAND32
data_src
SRC_STRING
src_len
fprintf
stdout
fixedstringtest
s\n
printf
SNPRINTF
main_vasink
va_list
args
va_start
vfprintf
va_end
main_vasinkb
main_vasinkg
_goodG2B_data
_goodB2G_data
b_main_vasink
vprintf
vsnprintf
fwprintf
wprintf
vfwprintf
vwprintf
_vsnwprintf
WIDE_STRING
data_dest
calloc
CHAR_STRING
wsadata
BOOL
wsa_init
FALSE
listener
client
hostname
HOSTNAME_SZ
TRUE
PF_INET
LISTEN_PORT
SetComputerNameA
CLOSESOCKET
150
149
strncmp
PASSWORD
Access
granted
denied
!
strcmp
strstr
P
wcsncmp
wcscmp
wcsstr
first
second
c
union
l
u
0x10203040
|
LONG_MIN
CHAR_MAX
result
Input
value
too
large
perform
arithmetic
safely
<=
sqrt
rand
INT_MAX
unsigned
UCHAR_MAX
printHexUnsignedCharLine
hc
UINT_MAX
printUnsignedLine
CHAR_MIN
small
INT_MIN
dst
DST_SZ
const
COPY_STR
short
hd
exit
hd\n
SHRT_MAX
username
USERNAME_SZ
password
PASSWORD_SZ
THE_USER
msg
Invalid
send
THE_PASSWORD
Welcome
truncated_username
TRUNCATED_USERNAME_SZ
stderr
User
logged
in\n
password_len
HANDLE
pHandle
domain
Domain
LogonUserA
LOGON32_LOGON_NETWORK
LOGON32_PROVIDER_DEFAULT
logge
in
CloseHandle
login
SecureZeroMemory
LogonUserW
FILENAME_MAX
BASEPATH
file
wb
fd
OPEN
O_RDWR
O_CREAT
S_IREAD
S_IWRITE
CLOSE
hFile
CreateFileA
GENERIC_WRITE
GENERIC_READ
OPEN_ALWAYS
FILE_ATTRIBUTE_NORMAL
INVALID_HANDLE_VALUE
CreateFileW
gets
Error
Condition
alter
control
flow
indicate
action
taken
s_in_client
s_in_client_len
hostent
h_client
gethostbyaddr
h_name
SECRET_HOSTNAME
string
hello
substr
c_str
try
catch
out_of_range
Range
specified
was
invalid
throw
25
e
Exception
caught
Please
enter
failed
fputc
EOF
fputs
fread
99s\0
fwrite
putc
putchar
puts
REMOVE
removememain
remove
RENAME
OLD_BAD_FILE_NAME
newmainfilename
OLD_GOOD_FILE_NAME
newgoodfilename
rename
scanf
SRC
snprintf
sscanf
hMutex
CreateMutexA
GetLastError
ERROR_ALREADY_EXISTS
pipeName
\\\\
\\pipe\\mypipe
hPipe
fConnected
CreateNamedPipeA
PIPE_TYPE_MESSAGE
PIPE_READMODE_MESSAGE
PIPE_WAIT
PIPE_UNLIMITED_INSTANCES
BUFSIZE
NMPWAIT_USE_DEFAULT_WAIT
ConnectNamedPipe
?
ERROR_PIPE_CONNECTED
ERROR_ACCESS_DENIED
FILE_FLAG_FIRST_PIPE_INSTANCE
ImpersonateNamedPipeClient
ImpersonateSelf
SecurityImpersonation
RpcImpersonateClient
RPC_S_OK
fputwc
WEOF
fputws
fwscanf
putwc
putwchar
_putws
wremove
wrename
wscanf
snwprintf
swscanf
CreateMutexW
CreateNamedPipeW
password_buf
password_file
fopen
passwords
password_copy
password_ptr1
password_ptr2
password_ptr
void_password_ptr
password_array
key
TEST\\TestKey
HKEY
hKey
RegCreateKeyExA
HKEY_LOCAL_MACHINE
REG_OPTION_NON_VOLATILE
KEY_WRITE
ERROR_SUCCESS
Registry
could
not
be
created
HKEY_CURRENT_USER
RegCreateKeyA
RegOpenKeyExA
opened
HUSKEY
SHRegCreateUSKeyA
SHREGSET_HKCU
outKey
SHRegOpenUSKeyA
RegCreateKeyExW
RegCreateKeyW
RegOpenKeyExW
SHRegCreateUSKeyW
SHRegOpenUSKeyW
pipe
\\pipe\\test_pipe
PIPE_ACCESS_DUPLEX
Impersonated
RevertToSelf
d\n
Failed
impersonate
HDESK
hDesk
dtName
DesktopExample
CreateDesktopA
GENERIC_ALL
Desktop
CloseDesktop
filename
FILE_ALL_ACCESS
FILE_SHARE_READ
CREATE_NEW
File
HWINSTA
hWStation
wStationName
WindowsStationExample
CreateWindowStationA
Windows
station
Station
CloseWindowStation
KEY_ALL_ACCESS
CreateDesktopW
CreateWindowStationW
Password1234
cryptokey
cryptokey_buf
CRYPTOKEY
HCRYPTPROV
cryptoprov
HCRYPTKEY
HCRYPTHASH
hash
DWORD
toBeEncryptedLen
toBeEncrypted
CryptAcquireContext
MS_ENHANCED_PROV
PROV_RSA_FULL
CRYPT_NEWKEYSET
acquiring
cryptographic
context
CryptCreateHash
CALG_SHA1
creating
CryptHashData
BYTE
hashing
CryptDeriveKey
CALG_3DES
CryptEncrypt
CryptEncryptData
cryptokey_len
cryptokey_copy
cryptokey_ptr1
cryptokey_ptr2
cryptokey_ptr
void_cryptokey_ptr
cryptokey_array
encrypted_block
BLOCK_SZ
decrypted_block
encrypted
rb
Z
13
26
ascii_key
ASCII_KEY_WITH_PADDING_SZ
j
key_sz
ASCII_KEY_SZ
^
PASSWORD_INPUT_SZ
ULONG
password_crc
compare_crc
len
ADLER_A_INIT
ADLER_B_INIT
ADLER_MOD
16
hCryptProv
pbData
CryptAcquireContextW
CryptGenRandom
CryptReleaseContext
_global_t
global
signal
SIGINT
SIG_DFL
_g_cur_main
val
helper_main
_g_cur_good
helper_good
switch
time
case
default
time_t
time_val
std_thread
thread_a
thread_b
g_main
std_thread_create
std_thread_join
std_thread_destroy
std_thread_lock_create
g_good_lock
std_thread_lock_destroy
g_good
ACCESS
W_OK
WRITE
Bad
Sink
Good
STAT
statbuf
float
0F
atof
printDoubleLine
double
f
tmp
myString
String
cout
after
call
helper
function
endl
template
fnXXXXXX
mktemp
Temporary
now
closing
O_EXCL
tempnam
tmpnam
MAX_PATH
GetTempFileNameA
_wmktemp
_wfopen
_wtempnam
_wtmpnam
GetTempFileNameW
BadSinkBody
file_ptr
w
Write
something
the
The
open
realloc
errno_t
err_code
_get_errno
EDOM
strtol
0xfffffffff
ERANGE
li\n
st
str
wcstombs
\xffff
EILSEQ
Success
Failure
error_code
E_OK
Other
success
err1
domain_error
err2
exception
ok
count
Hello
20
count_copy
count_ptr1
count_ptr2
count_ptr
void_count_ptr
count_array
output_main
SENTENCE
output_good
5L
130000
New
10L
_twoints
data_good
mystring
strdup
wcsdup
BadSource_fopen
_main_data_for_main_sink
freopen
BadSource_freopen
BadSource_open
CreateFile
BadSource_w32CreateFile
c\n
reversedString
BadSink
GoodSink
BAD_OS_COMMAND
POPEN
PCLOSE
GOOD_OS_COMMAND
system
_wsystem
250
PATH
PUTENV
NEW_PATH
data_uninit_array
temp
ch
getc
char_array
z
array
toPrint
pointer
Foo
p
end
ptrdiff_t
slash
indexOfSlash
string1
string2
slashInString1
indexOfSlashInString1
abcdefghijklmnopqrstuvwxyz
shouldn\
t
see
this
Got
0\n
input
INPUT_SZ
debug
Log
some
info
that
inappropriate
release
This
actual
functionality
TIME_CHECK
UNLINK
important_file
Happy
Year
attempted
access
with
access\n
AAAA
UMASK
0644
022
AAAAAAAAAAAA
foo
_main_global
does
use
variable
W
i_main
parameter
static_global_main
global_main
02lx\n
flag
Dead
code
Never
prints
Always
0x400000
VirtualLock
Memory
locked
bOptVal
bOptLen
setsockopt
SOL_SOCKET
SO_REUSEADDR
n
v
15
MAX_LOOP
assert
ASSERT_VALUE
newpassword
256
USER_INFO_1003
my_user_info_1003
NET_API_STATUS
status
usri1003_password
Enter
255s
NetUserSetInfo
USERNAME
1003
LPBYTE
NERR_Success
Status
0x
x\n
oldpassword
old
NetUserChangePassword
push_back
iterator
contains
begin
clear
200
GoodSource_fopen
GoodSource_open
GoodSource_w32CreateFile
cin
>>
width
sprintf
Initialize
WFOPEN
SEARCH_CHAR
We
have
match
BAD_SRC_FIXED
path
BAD_SZ
length
GetCurrentDirectoryA
PathAppendA
printSizeTLine
char_string
HELLO_STRING
less
than
source
or
10000
wchar_t_string
EXECL
COMMAND_INT_PATH
COMMAND_ARG1
COMMAND_ARG2
COMMAND_ARG3
EXECLP
COMMAND_INT
EXECV
EXECVP
FULL_COMMAND
_spawnl
_P_WAIT
_spawnlp
_spawnv
_spawnvp
_wspawnl
_wspawnlp
_wspawnv
_wspawnvp
data_badbuf
bad_struct
global_returns_f
global_returns_t
memcmp
attempt
log
Host
name
removemebad
toBeDecrypted
toBeDecryptedLen
99
CryptDecrypt
decryption
CryptDestroyHash
CryptDestroyKey
Prov
Hash
UCHAR
saved_hash
SHA1SUM_SIZE
calc_hash
hash_size
02x
CryptGetHashParam
HP_HASHVAL
output_bad
_bad_data_for_good_sink
_good
AAAAAAAAAAAAAA
get_x
Sometimes
