public
 
void
main
(
HttpServletRequest
request
,
HttpServletResponse
response
)
throws
Throwable
{
String
data
;
=
System
.
getenv
"
ADD
if
!=
null
Cookie
cookieSink
new
lang
addCookie
}
while
true
break
private
boolean
mainPrivate
false
mainSink
static
mainPublicStatic
b
a
else
dataCopy
mainSource
return
dataBad
[
]
dataArray
5
2
Container
dataContainer
containerOne
Object
dataObject
Vector
<
>
dataVector
add
0
1
remove
LinkedList
dataLinkedList
HashMap
Integer
dataHashMap
put
get
ByteArrayOutputStream
streamByteArrayOutput
ObjectOutput
outputObject
try
ObjectOutputStream
writeObject
byte
dataSerialized
toByteArray
catch
IOException
exceptIO
IO
logger
log
Level
WARNING
in
serialization
finally
close
Error
closing
ByteArrayInputStream
streamByteArrayInput
ObjectInputStream
streamObjectInput
readObject
deserialization
ClassNotFoundException
exceptClassNotFound
addHeader
Location
/
author
jsp?lang
+
setHeader
File
file
C
:
\\data
txt
FileInputStream
streamFileInput
InputStreamReader
readerInputStream
BufferedReader
readerBuffered
UTF
-
8
readLine
with
stream
reading
Socket
socket
host
example
org
39544
getInputStream
Connection
connection
PreparedStatement
preparedStatement
ResultSet
resultSet
getDBConnection
prepareStatement
select
name
from
users
where
id
executeQuery
getString
SQLException
exceptSql
SQL
statement
cookieSources
getCookies
getValue
Properties
properties
common
config
load
getProperty
user
home
getParameter
StringTokenizer
tokenizer
getQueryString
&
hasMoreTokens
ServerSocket
listener
39543
accept
URLConnection
urlConnection
URL
http
www
openConnection
staticReturnsTrueOrFalse
libraryName
test
dll
loadLibrary
root
os
toLowerCase
indexOf
win
>=
\\libs\\
libs
int
stringNumber
avoid
NPD
incidental
warnings
parseInt
trim
NumberFormatException
exceptNumberFormat
Number
format
exception
parsing
string
array
3
4
length
writeLine
Array
index
out
of
bounds
size
is
negative
42
cookie
parameter
'
query
100
SecureRandom
nextInt
printf
dbConnection
setCatalog
getting
database
main_source
Byte
parseByte
number
result
*
MAX_VALUE
java
security
MIN_VALUE
long
Long
parseLong
0L
nextLong
short
Short
parseShort
intArray
10
i
do
for
<=
throw
UnsupportedOperationException
exceptUnsupportedOperation
StringBuffer
password
dBConnection
append
DriverManager
getConnection
192
168
105
23
sa
toString
delete
\\uploads\\
uploads
streamFileInputSink
readerInputStreamSink
readerBufferdSink
exists
&&
isFile
bytesToRead
1024
byteArray
c
\\file
read
FileNotFoundException
exceptFileNotFound
opening
numberOfBytesRead
==
The
end
the
has
been
reached
Could
not
bytes
fis
passwordCopy
passwordBad
passwordArray
passwordContainer
passwordObject
passwordVector
passwordLinkedList
passwordHashMap
passwordSerialized
7e5tc4s3
url
test_table
KerberosPrincipal
principal
KerberosKey
key
toCharArray
PasswordAuthentication
credentials
BP@ssw0rd
getUserName
getPassword
auth
AP@ssw0rd
PrintWriter
writer
remote_host
1337
getOutputStream
println
writing
to
~j
asn
!
@#
as
stringToEncrypt
Super
secret
Squirrel
byteStringToEncrypt
getBytes
SecretKeySpec
secretKeySpec
AES
Cipher
aesCipher
getInstance
init
ENCRYPT_MODE
byteCipherText
doFinal
final
CIPHER_INPUT
ABCDEFG123456
KeyGenerator
keyGenerator
SecretKey
secretKey
generateKey
byteKey
getEncoded
encrypted
toHex
256
MessageDigest
messageDigest
SHA
512
digest
HASH_INPUT
update
DESede
112
tripleDesCipher
128
DES
56
desCipher
input
Test
Input
MD2
hashValue
MD5
SHA1
text
asdf
initializationVector
0x00
cipher
CBC
PKCS5Padding
IvParameterSpec
ivParameterSpec
blockSize
getBlockSize
secureRandom
nextBytes
SEED
0x01
0x02
0x03
0x04
0x05
setSeed
Math
random
nextDouble
Random
float
Float
parseFloat
0f
%
nextFloat
\n
FileOutputStream
streamFileOutput
OutputStreamWriter
writerOutputStream
BufferedWriter
writerBuffered
tempFile
createTempFile
temp
1234
write
temporary
setWritable
set
Writable
permissions
setReadable
Readable
setExecutable
Executable
directoryName
\\testcases\\insecureDir
testcases
insecureDir
newDirectory
isSuccessful
mkdir
Directory
created
\\src\\testcases\\CWE379_File_Creation_in_Insecure_Dir\\secureDir
CWE379_File_Creation_in_Insecure_Dir
secureDir
Runtime
getRuntime
exit
getWriter
You
cannot
shut
down
this
application
only
admin
can
\\lvl_1\\lvl_2\\lvl_3\\
lvl_1
lvl_2
lvl_3
mkdirs
directories
could
be
StringBuilder
errorString
getAbsolutePath
Exception
\\doesntexistandneverwill
doesntexistandneverwill
path
getMessage
systemProperty
CWE395
equals
Caught
Hello
sentence
good
x
switch
case
default
Inside
intOne
intFive
count
countCopy
countBad
countArray
countContainer
countObject
countVector
countLinkedList
countHashMap
countSerialized
getContentType
||
contains
multipart
form
InputStream
streamInput
output_main
dat
inputBytes
bytesRead
Uploaded
output_good
MAXSIZE
10485760
bytesReadCount
exceeds
Thread
sleep
deleteOnExit
create
Class
?
tempClass
forName
tempClassObject
newInstance
myString
greater
than
my
how
I
ve
changed
DataInputStream
streamDataInput
unixDate
util
Date
parse
2010
07
13
41
00
date
DateFormat
Convert
sentenceAsBytes
URLEncoder
encode
abc
|
$#@
stringIntValue
zeroOrOne
isZero
y
intRandom
stringValue
one
Default
CWE486_Compare_Classes_by_Name
HelperClass
CWE486_Compare_Classes_by_Name__Helper
helperClass
helperClassRoot
getClass
getSimpleName
Classes
are
same
different
payload
0297b5eb43e3b81f9c737b353c3ade45
ABCDEFGHABCDEFGH
DECRYPT_MODE
payloadLength
Character
digit
charAt
16
<<
decryptedPayload
exec
executing
command
decodedPayload
calc
exe
encodedPayload
Y2FsYy5leGU
Base64
decodeBase64
\\test_main
lastModified
This
line
setLastModified
10000L
O
error
\\test_good
OutputStream
streamOutput
port
20000
getInetAddress
getHostName
google
com
Welcome
connect
objects
getHostAddress
30
123
\\windows\\system32\\evil
Sorry
your
license
expired
Please
contact
support
Calendar
calendarNow
calendarCheck
2020
after
action
hostname
j_security_check
method
post
table
tr
td
Name
type
j_username
Password
j_password
br
submit
value
login
There
was
problem
https
Not
PATH
username
matches
zA
Z0
9
HttpSession
session
getSession
Username
Session
ID
getId
Invalid
characters
logged
Logger
getLogger
cwe_testcases_logger
FINEST
writerPrint
err
SecretMessage
setMaxAge
60
24
365
emergency
broadcast
system
\
form\
post\
servlet\
username\
text\
tabindex
10\
password\
submit\
Login
main\
good\
Good
5L
Reinitialize
10L
nfx
invoices
uid
setInt
writeString
requested
Main
thread
currentThread
getName
threadOne
run
In
threadTwo
IllegalArgumentException
exceptIllegalArgument
preventing
issues
block
cleaning
up
CWE586_Explicit_Call_to_Finalize__basic_Helper
mainObj
sayHello
An
occurred
finalize
goodObj
string1
string2
Strings
equal
URI
uri
URISyntaxException
exceptURISyntax
redirect
sendRedirect
socket1
socket2
bind
InetSocketAddress
15000
localhost
Unable
15001
numberOfLoops
Numeric
expected
Assuming
hello
world
sesssion
setMaxInactiveInterval
still
valid
getCreationTime
30000
currentTimeMillis
Invalidating
per
absolute
timeout
enforcement
invalidate
isSecure
Drink
Ovaltine
setSecure
DB
joe
test\
dbusername
dbpassword
Submit
assert
cwe617
xmlFile
\\src\\testcases\\CWE643_Xpath
Injection\\CWE643_Xpath_Injection__Helper
xml
src
CWE643_Xpath
Injection
CWE643_Xpath_Injection__Helper
tokens
split
XPath
xPath
XPathFactory
newXPath
InputSource
inputXml
and
pass
evaluate
XPathConstants
STRING
CWE690_NULL_Deref_From_Return__Class_Helper
getStringBuilderBad
stringTrimmed
getStringBad
propertiesFileName
CWE690_NULL_Deref_From_Return__Helper
CWE690
open
e
doing
some
more
things
here
hash
me
prng
SHA1PRNG
generateSeed
32
ArrayList
intArrayList
intHashMap
HashSet
intHashSet
byteArrayList
freeMemory
enough
memory
go
again
osCommand
\\WINDOWS\\SYSTEM32\\cmd
dir
bin
ls
Process
process
waitFor
replaceAll
script
img
names
successCount
Statement
sqlStatement
createStatement
addBatch
hitcount
resultsArray
executeBatch
Succeeded
queries
Statament
rowCount
executeUpdate
insert
into
status
values
updated
Updated
rows
successfully
Boolean
execute
records
Hashtable
environmentHashTable
Context
INITIAL_CONTEXT_FACTORY
sun
jndi
ldap
LdapCtxFactory
PROVIDER_URL
389
DirContext
directoryContext
InitialDirContext
search
cn
NamingEnumeration
SearchResult
answer
hasMore
searchResult
next
Attributes
attributes
getAttributes
allAttributes
getAll
Attribute
attribute
allValues
Value
NamingException
exceptNaming
LDAP
service
found
or
failed
foo
dataGoodG2B
dataGoodB2G
s
n
main_private
too
large
perform
addition
multiplication
abs
sqrt
squaring
small
subtraction
decryptedPassword
passwordGoodG2B
passwordGoodB2G
GP@ssw0rd
salt
ThisIsMySalt
reset
credentialsToHash
hashedCredsAsBytes
Password1234
World
SSLSocketFactory
sslsSocketFactory
SSLSocket
sslSocket
getDefault
createSocket
000001
would
divide
by
zero
modulo
bad
20
countGoodG2B
countGoodB2G
badSink
goodSink
2000
Testing
valueOf
two
StringEscapeUtils
escapeXml
getStringBuilderGood
getStringGood
setString
increment
decrement
